<?php

use Illuminate\Database\Seeder;

class BlogsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $text1 = 'ГЛАВА XXXV. ЕГО ЛЮБИЛИ ДОМАШНИЕ ХОЗЯЙКИ, ДОМАШНИЕ РАБОТНИЦЫ, ВДОВЫ И ДАЖЕ ОДНА ЖЕНЩИНА-ЗУБНОЙ ТЕХНИК
  В Черноморске гремели крыши и по улицам гуляли сквозняки.
Силою неожиданно напавшего на город северо-восточного ветра нежное бабье лето было загнано к мусорным ящикам, желобам и выступам домов. Там оно помирало среди обугленных кленовых листьев и разорванных трамвайных билетов. Холодные хризантемы тонули в мисках цветочниц. Хлопали зеленые ставни закрытых квасных будок. Голуби говорили "умру, умру". Воробьи согревались, клюя горячий навоз. Черноморцы брели против ветра, опустив головы, как быки. Хуже всех пришлось пикейным жилетам.
Ветер срывал с них канотье и панамские шляпы и катил их по паркетной мостовой вниз, к бульвару. Старики бежали за ними, задыхаясь и негодуя. Тротуарные вихри мчали самих преследователей так сильно, что они иной раз перегоняли свои головные уборы и приходили в себя только приткнувшись к мокрым ногам бронзовой фигуры екатерининского вельможи, стоявшего посреди площади.
  "Антилопа" на своей стоянке издавала корабельные скрипы.

Если раньше машина Козлевича вызывала веселое недоумение, то сейчас она внушала жалость: левое заднее крыло было подвязано канатом, порядочная часть ветрового стекла была заменена фанерой, и вместо утерянной при катастрофе резиновой груши с "матчишем" висел на веревочке никелированный председательский колокольчик. Даже рулевое колесо, на котором покоились честные руки Адама Казимировича, несколько свернулось в сторону. На тротуаре, рядом с "Антилопой", стоял великий комбинатор.

Облокотившись о борт машины, он говорил:

  -- Я обманул вас, Адам. Я не могу подарить вам ни "изотта-фраскини", ни "линкольна", ни "бьюика", ни даже "форда". Я не могу купить новой машины. Государство не считает меня покупателем. Я частное лицо. Единственно, что можно было бы приобрести по объявлению в газете, -- это такую же рухлядь, как наша "Антилопа".

  -- Почему же, -- возразил Козлевич, -- мой "лорендитрих" -- добрая машина. Вот если бы еще подержанный маслопроводный шланг, не нужно мне тогда никаких "бьюиков".

  -- Шланг я вам привез, -- сказал Остап, -- вот он. И это единственное, дорогой Адам, чем я могу помочь вам по части механизации транспорта.

  Козлевич очень обрадовался шлангу, долго вертел его в руках и тут же стал прилаживать. Остап толкнул колокольчик, который издал заседательский звон, и горячо начал:

  -- Вы знаете, Адам, новость -- на каждого гражданина давит столб воздуха силою в двести четырнадцать кило!

  -- Нет, - сказал Козлевич, - а что?

  -- Как что! Это научно-медицинский факт. И мне это стало с недавнего времени тяжело. Вы только подумайте! Двести четырнадцать кило! Давят круглые сутки, в особенности по ночам.

Я плохо сплю. Что?

  -- Ничего, я слушаю, -- ласково ответил Козлевич.

  -- Мне очень плохо, Адам. У меня слишком большое сердце.

  Водитель "Антилопы" хмыкнул. Остап продолжал болтать:

  -- Вчера на улице ко мне подошла старуха и предложила купить вечную иглу для примуса. Вы знаете, Адам, я не купил.

Мне не нужна вечная игла, я не хочу жить вечно. Я хочу умереть.

У меня налицо все пошлые признаки влюбленности: отсутствие аппетита, бессонница и маниакальное стремление сочинять стихи.

Слушайте, что я накропал вчера ночью при колеблющемся свете электрической лампы: "Я помню чудное мгновенье, передо мной явилась ты, как мимолетное виденье, как гений чистой красоты".

Правда, хорошо? Талантливо? И только на рассвете, когда дописаны были последние строки, я вспомнил, что этот стих уже написал А. Пушкин. Такой удар со стороны классика! А?

  -- Нет, нет, продолжайте, -- сказал Козлевич сочувственно.

  -- Так вот и живу, -- продолжал Остап с дрожью в голосе.

-- Тело мое прописано в гостинице "Каир", а душа манкирует, ей даже в Рио-де-Жанейро не хочется. А тут еще атмосферный столб душит.

  -- А вы у нее были? -- спросил прямолинейный Козлевич. --

У Зоси Викторовны?

  -- Не пойду, -- сказал Остап, -- по причине гордой застенчивости. Во мне проснулись янычары. Я этой негодяйке послал из Москвы на триста пятьдесят рублей телеграмм и не получил ответа даже на полтинник. Это я-то, которого любили домашние хозяйки, домашние работницы, вдовы и даже одна женщина -- зубной техник. Нет, Адам, я туда не пойду. До свидания!

  Великий комбинатор отправился в гостиницу, вытащил из-под кровати чемодан с миллионом, который валялся рядом со стоптанными башмаками. Некоторое время он смотрел на него довольно тупо, потом взял его за ручку и выбрался на улицу.

Ветер схватил Остапа за плечи и потащил к Приморскому бульвару, Здесь было пустынно, никто не сидел на белых скамейках, изрезанных за лето любовными надписями. На внешний рейд, огибая маяк, выходил низкий грузовик с толстыми прямыми мачтами.
  -- Довольно, -- сказал Остап, -- золотой теленок не про меня. Пусть берет кто хочет. Пусть миллионерствует на просторе!
  Он оглянулся и, видя, что вокруг никого нет, бросил чемодан на гравий.';

        $text2 = "The other answers are great for Laravel 4 but Laravel 5 is here! We now have the ability to generate all kinds of stuff by default. Run php artisan help to view all artisan commands. Here are all of the make commands:

make
  make:command         Create a new command class
  make:console         Create a new Artisan command
  make:controller      Create a new resource controller class
  make:event           Create a new event class
  make:middleware      Create a new middleware class
  make:migration       Create a new migration file
  make:model           Create a new Eloquent model class
  make:provider        Create a new service provider class
  make:request         Create a new form request class";
        $text3 = "Гороскоп на сьогодні, 25 квітня

Из того факта, что вам задают вопрос, отнюдь не следует, что вы обязаны на него отвечать. Тем более при отсутствии адвоката. Защищайте собственные интересы ревностнее.";
        $blogs = array([
            'title' => 'First Blog',
            'body' => nl2br($text1),
            'posted_at' => '2015-04-25 18:00:00',
            'photo' => 'img/1s8UVhGmBN8GCmMxyIRX.jpg'
        ],
        [
            'title' => 'Second Blog',
            'body' => nl2br($text2),
            'posted_at' => '2016-03-25 10:01:00',
            'photo' => 'img/GoRSUYXzz54gYnC5QxeB.jpg'
        ],
        [
            'title' => 'New',
            'body' => nl2br($text3),
            'posted_at' => '2017-04-25 10:00:00',
            'photo' => 'img/K2WBOCpdy2GPtRC4h1Ax.jpg'
        ]);

        DB::table('blogs')->insert($blogs);
    }
}
